Revit 2027 API
BRepBuilderPersistentIds.IsValidBRepBuilderGeometryIdForNewCorrespondence Method
 Validates the input BRepBuilderGeometryId that will be used to create a correspondence. In order to be valid, a correspondence for the input BRepBuilderGeometryId must not already exist.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidBRepBuilderGeometryIdForNewCorrespondence(
	BRepBuilderGeometryId brepBuilderGeometryId
)
Public Function IsValidBRepBuilderGeometryIdForNewCorrespondence (
	brepBuilderGeometryId As BRepBuilderGeometryId
) As Boolean
public:
bool IsValidBRepBuilderGeometryIdForNewCorrespondence(
	BRepBuilderGeometryId^ brepBuilderGeometryId
)
member IsValidBRepBuilderGeometryIdForNewCorrespondence :
        brepBuilderGeometryId : BRepBuilderGeometryId -> bool
Parameters
brepBuilderGeometryId BRepBuilderGeometryId
 The BRepBuilderGeometryId to be used in a new correspondence.
Return Value
Boolean
 True if the input BRepBuilderGeometryId can be used to create a new correspondence.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BRepBuilderPersistentIds Class
Autodesk.Revit.DB Namespace